# 1.1. 
# Программа 1: Мессенджер
# Классы:
# 1) Пользователь: имя, фамилия, номер телефона, фото профиля, айди
# 2) Чат: название, список участников, дата создания, тип (личный, групповой, канал), создатель чата
# 3) Сообщение: текст, отправитель, ссылка на чат получателя, время отправки, статус прочтения, вложения, тип (текст, голосовое)

# Программа 2: Приложение для доставки пиццы
# Классы:
# 1) Пользователь: имя, фамилия, номер телефона, айди, список адресов, привязанные карты для оплаты, бонусы, настройки
# 2) Продукт (пицца): состав, цена, доступные размеры для заказа, время приготовления
# 3) Заказ: продукты, адрес доставки, способ оплаты, статус заказа, время создания, итоговая стоимость

# Программа 3: Браузер
# Классы:
# 1) Страница: имя, ссылка, содержимое, иконка, кэш 
# 2) Профиль: имя пользователя, настройки, закладки, история посещений, сохраненные пароли, загрузки
# 3) Поисковая строка: текст запроса, история поиска, автодополнение, поисковая система по умолчанию
